## Plan Result (sbox_landing)




<pre><code>Plan: 42 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.roles[&#34;00-ingest00-di001-sbox-User-Alex.Bance@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-di001-sbox-User-Alex.Bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-di002-sbox-User-Alex.Bance@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-di002-sbox-User-Alex.Bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-dp001-sbox-User-Alex.Bance@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-dp001-sbox-User-Alex.Bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-dp002-sbox-User-Alex.Bance@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-dp002-sbox-User-Alex.Bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-external-storage-sbox-User-Alex.Bance@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-external-storage-sbox-User-Alex.Bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-logging-sbox-User-Alex.Bance@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-logging-sbox-User-Alex.Bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-management-sbox-User-Alex.Bance@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-management-sbox-User-Alex.Bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-metadata-sbox-User-Alex.Bance@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-metadata-sbox-User-Alex.Bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-network-sbox-User-Alex.Bance@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-network-sbox-User-Alex.Bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-runtimes-sbox-User-Alex.Bance@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-runtimes-sbox-User-Alex.Bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-shared-integration-sbox-User-Alex.Bance@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-shared-integration-sbox-User-Alex.Bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-shared-product-sbox-User-Alex.Bance@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-shared-product-sbox-User-Alex.Bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-storage-sbox-User-Alex.Bance@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-storage-sbox-User-Alex.Bance@justice.gov.uk&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].time_static.pim_start
* Update
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.product_team_access_policy




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.roles["00-ingest00-di001-sbox-User-Alex.Bance@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "582ce75e-4cfb-4d1b-958e-e8cd9dc08a77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-di001-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-di001-sbox-User-Alex.Bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-di001-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-di002-sbox-User-Alex.Bance@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "582ce75e-4cfb-4d1b-958e-e8cd9dc08a77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-di002-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-di002-sbox-User-Alex.Bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-di002-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-dp001-sbox-User-Alex.Bance@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "582ce75e-4cfb-4d1b-958e-e8cd9dc08a77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-dp001-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-dp001-sbox-User-Alex.Bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-dp001-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-dp002-sbox-User-Alex.Bance@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "582ce75e-4cfb-4d1b-958e-e8cd9dc08a77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-dp002-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-dp002-sbox-User-Alex.Bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-dp002-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-external-storage-sbox-User-Alex.Bance@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "582ce75e-4cfb-4d1b-958e-e8cd9dc08a77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-external-storage-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-external-storage-sbox-User-Alex.Bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-external-storage-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-logging-sbox-User-Alex.Bance@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "582ce75e-4cfb-4d1b-958e-e8cd9dc08a77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logging-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-logging-sbox-User-Alex.Bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logging-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-management-sbox-User-Alex.Bance@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "582ce75e-4cfb-4d1b-958e-e8cd9dc08a77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-management-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-management-sbox-User-Alex.Bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-management-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-metadata-sbox-User-Alex.Bance@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "582ce75e-4cfb-4d1b-958e-e8cd9dc08a77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-metadata-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-metadata-sbox-User-Alex.Bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-metadata-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-network-sbox-User-Alex.Bance@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "582ce75e-4cfb-4d1b-958e-e8cd9dc08a77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-network-sbox-User-Alex.Bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-runtimes-sbox-User-Alex.Bance@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "582ce75e-4cfb-4d1b-958e-e8cd9dc08a77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-runtimes-sbox-User-Alex.Bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-shared-integration-sbox-User-Alex.Bance@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "582ce75e-4cfb-4d1b-958e-e8cd9dc08a77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-shared-integration-sbox-User-Alex.Bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-shared-product-sbox-User-Alex.Bance@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "582ce75e-4cfb-4d1b-958e-e8cd9dc08a77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-shared-product-sbox-User-Alex.Bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-storage-sbox-User-Alex.Bance@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "582ce75e-4cfb-4d1b-958e-e8cd9dc08a77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-storage-sbox-User-Alex.Bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].module.logging_vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            "List",
          + "Get",
            "Update",
            # (10 unchanged elements hidden)
        ]
        id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logging-sbox/providers/Microsoft.KeyVault/vaults/ingest00-logging-sbox/objectId/e7ea2042-4ced-45dd-8ae3-e051c6551789"
      ~ key_permissions         = [
            "List",
          + "Get",
            "Update",
            # (4 unchanged elements hidden)
        ]
      ~ secret_permissions      = [
            "List",
          + "Get",
            "Set",
            # (2 unchanged elements hidden)
        ]
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.metadata_vault["meta001"].azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            "List",
          + "Get",
            "Update",
            # (10 unchanged elements hidden)
        ]
        id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-metadata-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta001-sbox/objectId/e7ea2042-4ced-45dd-8ae3-e051c6551789"
      ~ key_permissions         = [
            "List",
          + "Get",
            "Update",
            # (4 unchanged elements hidden)
        ]
      ~ secret_permissions      = [
            "List",
          + "Get",
            "Set",
            # (2 unchanged elements hidden)
        ]
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.metadata_vault["meta002"].azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            "List",
          + "Get",
            "Update",
            # (10 unchanged elements hidden)
        ]
        id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-metadata-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/e7ea2042-4ced-45dd-8ae3-e051c6551789"
      ~ key_permissions         = [
            "List",
          + "Get",
            "Update",
            # (4 unchanged elements hidden)
        ]
      ~ secret_permissions      = [
            "List",
          + "Get",
            "Set",
            # (2 unchanged elements hidden)
        ]
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.storage["curated"].azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00curatedsbox"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.data_landing_zone["00"].module.storage["curated"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["curated"].time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["curated"].time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["external"].azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-external-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00externalsbox"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.data_landing_zone["00"].module.storage["external"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["external"].time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["external"].time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["raw"].azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00rawsbox"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.data_landing_zone["00"].module.storage["raw"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["raw"].time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["raw"].time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00workspacesbox"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.data_landing_zone["00"].module.storage["workspace"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

Plan: 42 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":15,"Program":"tfcmt","SHA1":"","Target":"sbox_landing","Vars":{}} -->